Revit 2017 API
FabricWireItem Properties
The FabricWireItem type exposes the following members.
Properties
Name | Description
Distance
 Distance to the next fabric wire item
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
WireLength
 Wire length for this wire item
WireType
 The wire type of this wire item
See Also
FabricWireItem Class
Autodesk.Revit.DB.Structure Namespace